[{"pk": 1, "model": "contact.person", "fields": {"user": 1, "email": ""}}, {"pk": 2, "model": "contact.person", "fields": {"user": 3, "email": ""}}, {"pk": 3, "model": "contact.person", "fields": {"user": 2268, "email": ""}}, {"pk": 6, "model": "contact.person", "fields": {"user": 280, "email": ""}}, {"pk": 1, "model": "contact.subject", "fields": {"slug": "arst", "order": 3, "person": 1, "subject": "Question regarding txrxlabs.org account"}}, {"pk": 2, "model": "contact.subject", "fields": {"slug": "arst", "order": 2, "person": 1, "subject": "Question about a class"}}, {"pk": 3, "model": "contact.subject", "fields": {"slug": "arst", "order": 1, "person": 6, "subject": "Report a problem with a machine or question about machine maintenance "}}, {"pk": 4, "model": "contact.subject", "fields": {"slug": "arst", "order": 9999, "person": 3, "subject": "Other Questions"}}, {"pk": 5, "model": "contact.subject", "fields": {"slug": "cancel_class", "order": 0, "person": 3, "subject": "Request a refund or member discount for a class"}}, {"pk": 1, "model": "contact.message", "fields": {"user": 2862, "subject": 5, "from_name": "Morgan Sean", "message": "Good morning,\r\n\r\nI would like to know if it is possible the re-book the Welding I class I signed up for (currently 12-Mar-15) to the 26-Mar-15.\r\n\r\nThank you\r\nMorgan Sean", "from_email": "m_mccright85@hotmail.com"}}, {"pk": 2, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Tyler Martindale", "message": "Hello there!  \r\n\r\nMy name is Tyler Eugene Martindale and I am writing to you today to ask for your help.  I am interested in creating a makerspace in my hometown of Fayetteville, AR.  My facebook page uses my full name if you want a verification that I am not a rival enterprise.  My vision of our as-of-yet-non-existent makerspace looks very much like what you have created in TXRX Labs.  \r\n\r\nSeeing as one of the fundamental tenets of the concept is collaboration I am appealing to your sense of duty to fellow - and non-competitive due to geography - makers and am asking for a small amount of your time to answer a few questions regarding the formation and growth of your business and how that can help me wrap my mind around exactly what it is I am doing.  When exploring the idea to start any new venture one is encouraged to seek the wisdom of those who have already succeeded.  You have apparently succeeded so here I am.\r\n\r\nBelow is a list of questions/topics I would like to explore with you.  If you would prefer to talk over the phone I would be ecstatic.  Let me know a time and number at which you can be reached if you would prefer that.  I promise not to take any more than 15-20 minutes, unless we really hit it off in which case all bets are off.  \r\n\r\n1.  Membership:   How many members (tool access vs dedicated studio space) do you currently have?  What was the growth like to get to that number i.e. how long did it take to get to where you are?  What sort of month-over-month retention rate do your members display?  \r\n\r\n2.  Facilities/Tools/Services:  What is your current square footage?  Has that number grown since you started?  Did you move or expand existing facilities?  What tools did you provide at launch and how have you grown to include what you now offer?  Can you say with certainty that more interest is shown in woodworking vs metalworking vs electronics vs any other specific 'making' category?  In the beginning did you plan to offer as much as you do now or has the growth been more 'organic' than originally planned?  How do you finance the big equipment acquisitions?  Do you offer any 'consumable' materials to your members or are they required to provide their own materials all the time?  \r\n\r\n3.  Business:  Basically any financial information you are willing to share would be greatly appreciated.  I have a degree in economics but this will be my first startup.  The things I am looking for specifically are: how much of your revenue is based on memberships?  Classes?  Studio rental space?  Other revenue streams (what those might be?)?  What insurance do you carry and what is that expense?  What your monthly utility bill looks like?  Do you advertise?  New membership acquisition costs?  And finally:  How is the ownership and business structured?  Is it a co-op, non-profit, or a privately held, for-profit enterprise?  And, depending on the ownership and management structure, how were you initially financed?  You see, I don't have a lot of (read: nearly zero) money and am stuck on how to structure this thing.  \r\n\r\nThank you thank you thank you for taking the time to read through this.  I hadn't planned on it being so long but I got carried away thinking you were so kind and generous and willing to help out someone as interested in community, collaboration, and economic development as yourselves.  I have tried to drum up as much interest as possible through our local subreddit (r/fayetteville).  Here are the links so you can see where I am:\r\n\r\nhttp://www.reddit.com/r/fayetteville/comments/2w8mp3/makerspaceworkshop/\r\n\r\nhttp://www.reddit.com/r/fayetteville/comments/2wy21c/makerspace_meeting/\r\n\r\nAgain, thank you for any help you are willing to spare.  I am meeting with the community at-large in two weeks so any information you can spare will be shared at that meeting.  \r\n\r\nI look forward to hearing from you! Thanks again!\r\n\r\n*you see what i did there?!", "from_email": "temarti17@gmail.com"}}, {"pk": 3, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Daniel", "message": "I'm curious about using your cnc plasma cutter & welding equipment.\r\nWhat are your requirements for me to use that equipment.  If a membership is required, which membership would cost me the least if I used your equipment in the following scenarios:\r\n1.  Scenario 1:  I use your equip 3 times in 1 week for 2 different weeks during a 1 month period\r\n2.  Scenario 2:  I use your equip 2 times in 1 week during 2 different months of the year.\r\n\r\nThank you,\r\nD", "from_email": "zeffur@gmail.com"}}, {"pk": 4, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Charlie Jones", "message": "We are an Architectural Graphics and Signage Company in Austin.  We are looking for a solid candidate for two positions with our firm.  We are currently seeking a Production Tech as well as a Installation Tech.  If you have any place to post this for your students, please do.  Love your concept!  Thanks. ~ Charlie", "from_email": "charlie@buildingimagegroup.com"}}, {"pk": 5, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Ryan Alam", "message": "Hey guys! My name's Ryan, I work for a live music design and production company in Los Angeles called Production Club. I was in Houston a few months ago and I stopped by a cool makers' market where TXRX had a booth. They were doing cool all sorts of cool stuff, but what caught my eye was the 3D Printed Portraits. We'd really like to implement something like this for the events that we throw (we do stuff for Amazon, Minecraft, GDC, and a bunch of other cool tech conferences), and it would be really cool to have a photo booth that incorporates 3d printing. I'm wondering if I can have a conversation with someone at TXRX about it!\r\n\r\nI can be reached at ryan@productionclub.net, or on my mobile, which is 832-724-1901.\r\n\r\nThanks guys!\r\nRyan", "from_email": "ryan@productionclub.net"}}, {"pk": 6, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Duman Kydykov", "message": "Hello TX/RX,\r\n\r\nFirst of all, I would like to briefly introduce myself. My name is Duman Kydykov and I am a student at University of Houston Main Campus. I am majoring in Mechanical Engineering Technology. I am also a Vice Chair for SME UH. (Society of Manufacturing Engineers). I wanted to reach out to you guys and see if you would be interested in working with SME UH Chapter and its students. SME UH Chapter is an organization run by students just like me and our goal is to promote manufacturing, engineering, and technology in applied way. What we are trying to do is to help students not only learn the concepts but actually apply it. In our senior year we all have to work on our senior design projects. Mechanical Engineering Technology major is the biggest major in the entire university. We want student to know about TX/RX and actually go to your labs and practice. your prices are very reasonable and I know that you guys are nonprofit organization. I think if we could partner with you and help promote applied engineering, it would benefit a lot of students. I personally have not been to your lab yet but I would love to visit and take a tour. \r\n\r\nYou could reach my at dumany1115@gmail.com \r\nI would appreciate your response. \r\n\r\nThank you,\r\n\r\nSincerely,\r\n\r\nDuman Kydykov", "from_email": "dumany1115@gmail.com"}}, {"pk": 7, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Ivan Puckett", "message": "When will the next class(es) be for C or C+ or C++ be?\r\n\r\nThanks", "from_email": "puckettivan@gmail.com"}}, {"pk": 8, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "David Ray", "message": "Hey guys I just joined TXRX today and wanted to ask when you are offering your new member orientation courses?\r\n", "from_email": "davidlrayjr@gmail.com"}}, {"pk": 9, "model": "contact.message", "fields": {"user": 2121, "subject": 5, "from_name": "David Janowitz", "message": "Please cancel me for both lathe classes (I and II) and send me a refund.  Thanks! ", "from_email": "elstupido@att.net"}}, {"pk": 10, "model": "contact.message", "fields": {"user": 2121, "subject": 5, "from_name": "David Janowitz", "message": "Please cancel me for both lathe classes (I and II) and send me a refund.  Thanks! ", "from_email": "elstupido@att.net"}}, {"pk": 11, "model": "contact.message", "fields": {"user": 2986, "subject": 4, "from_name": "treyrasch", "message": "I cannot seem to find the daily business hours anywhere on the site. What are they?", "from_email": "treyrasch@gmail.com"}}, {"pk": 12, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Kasia Grabowicz", "message": "Hi,\r\n\r\nI am Kasia Grabowicz, a researcher and designer at Claro Partners, a business innovation firm based in Barcelona (www.claropartners.com). \r\nTogether with my colleague Jiri Vermeulen, I am also co-organising the IoT Meetup in Barcelona, the second biggest IoT community in Europe. \r\n\r\nOn the 12th of March, we will be in Austin to hold a one day IoT workshop in collaboration with WebVisions at SXSW, an incubator of cutting-edge technologies and digital creativity. The Lab is about creating and building people centred IoT concepts by teams with diverse backgrounds -makers, developers, designers and strategists. \r\n\r\nHave a look at the video that shows the atmosphere at an IoT Lab: http://vimeo.com/106296566 I think this is a great opportunity for the TX/RX community to meet new, like-minded people and learn more about the Internet of Things. We would like to invite you and all the members to join our hands-on workshop to develop the next big IoT product or service based on real human needs. The event will be hosted at the public library of Austin. We ask for a small contribution of 10 euro to each participant to cover our expenses. \r\n\r\nParticipants can subscribe here: https://sxsw-iotlab.eventbrite.com \r\n\r\nDo you think it would be possible to share this invitation with others? If you have any further questions, please don't hesitate to contact me! If it sounds interesting I will be happy to send you detailed information.\r\n\r\n\r\nThanks, \r\n\r\nKasia", "from_email": "kasia.grabowicz@claropartners.com"}}, {"pk": 13, "model": "contact.message", "fields": {"user": 2552, "subject": 4, "from_name": "David", "message": "Hello!\r\n\r\nIt will be my first time coming to TXRX Labs and pretty excited.  My friend (Morgan Mccright) and I (David Moon) signed up for the Welding I class for March 26th.  I was wondering if it was possible to move us both to March 12th.  Thank you for your time and sorry for any inconvenience.\r\n", "from_email": "oppa637@gmail.com"}}, {"pk": 14, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Rene Magdaleno ", "message": "Hi,\r\n\r\nI have a bunch of electronics destined for recycling. These include projectors, touch panels, matrix switches, etc.  Some work, some don't. Most devices have very good power supplies, fans, enclosures, etc. that can be salvaged. Also could be good for troubleshooting practice. \r\n\r\nThey would have to be picked up. Let me know if you're interested, I need them gone asap. Thanks!\r\n\r\n~Rene M. ", "from_email": "Rmagdaleno@gmail.com"}}, {"pk": 15, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "lois meyer", "message": "Roland, I finally have my welding project thought thru and planned.  I wanted to run it past you before I moved forward.  So you have time when you are not teaching that we can talk for a few minutes.  In the evening during the week would work for me as well.\r\n\r\nthanks!", "from_email": "lmeyer@lucasgroup.com"}}, {"pk": 16, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Ariana", "message": "Hello! I'm looking for an artist who creates scrap metal sculptures! Please let me know if you know anyone! Thanks! 713-679-3985", "from_email": "ariet@beayingprojects.com"}}, {"pk": 17, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Patrick Duncan", "message": "I noticed a mistake in the Concrete Counter class. You state the date as 3/16 (Sat). The 14th is a Saturday, the 16th is a Monday. So which is wrong, Date or Day?", "from_email": "patrickduncan56@gmail.com"}}, {"pk": 18, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Keith Strahan", "message": "I was told about your group from a friend that I went to law school with. After perusing the website and Facebook group, I would love to support what you all are doing.\r\n\r\nI have recently started a law firm that wants to cater to small business and start ups. Because my passion is the entrepreneur, I would love to learn more about what TX/RX does.\r\n\r\nFeel free to email me (keith@strahanlawfirm.com). I look forward to hearing from y'all.\r\n\r\n- Keith", "from_email": "keith@strahanlawfirm.com"}}, {"pk": 19, "model": "contact.message", "fields": {"user": 2946, "subject": 4, "from_name": "David", "message": "I'm doing my first class at TXRX tonight.  I noticed there are different membership levels.  The \"Table Hacker\" membership indicates they I would get my own private, dedicated work table.  One thing it doesn't specify is if it allows access outside of normal business hours as well?\r\n\r\nDoes it allow access outside of business hours?  Also what are the business hours?", "from_email": "davetha@gmail.com"}}, {"pk": 20, "model": "contact.message", "fields": {"user": 1, "subject": 5, "from_name": "Chris Cauley", "message": "Did this go to the right address?", "from_email": "chris@lablackey.com"}}, {"pk": 21, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "jayesh naik", "message": "Can we get help to machine small hoged / CNC out aluminum blocks ( size under 3 inches cube )\r\n\r\nI am mentor for Klien Robotics and we are building with... 1 Inch Sq Tubing\r\n\r\nHigh School / FIRST Robotics.\r\n\r\nJayesh Naik\r\nCell: 215 380 4035\r\n\r\njnaikusa@gmail.com", "from_email": "jnaikusa@gmail.com"}}, {"pk": 22, "model": "contact.message", "fields": {"user": 2795, "subject": 1, "from_name": "lroche77", "message": "Hi! My boyfriend and I are signed up to take Welding 1 on 3/28/2015. I was wondering if it was possible to reschedule from that date to another Welding 1 class on a weekend in the future? There are currently no other weekend classes scheduled but I wasn't sure if it was possible to switch dates. \r\n\r\nAny info is greatly appreciated! Thank you!\r\n\r\nLauren Roche\r\nLROCHE77@GMAIL.COM", "from_email": "lroche77@gmail.com"}}, {"pk": 23, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Melissa Galan", "message": "Hi there,\r\n\r\nFirstly, I apologize for the short notice.  I am scheduled for two classes coming up soon.  The DSLR class on Saturday, March 7, 2015 and the bike maintenance class the follow weekend.  \r\n\r\nI have injured my back and have been prescribed medications and bed rest that will make me unable to attend class on March 7.  I am, however, still hopeful I can make it the maintenance class on the 14th.\r\n\r\nI would rather not take a refund as I was really looking forward to taking the DSLR class.  I am wondering if I could reschedule for the next available class.\r\n\r\nThanks for your time.  \r\n\r\nMelissa", "from_email": "melissa77029@hotmail.com"}}, {"pk": 24, "model": "contact.message", "fields": {"user": 3014, "subject": 5, "from_name": "j.tenorio.egr", "message": "Hello,\r\n\r\nI would like to receive a refund for the scheduled Woodworking: Adirondack Chair Making Mar 14 -15. I signed up believing the expenses covered two people making one chair (quantity 1 for checkout) but after contacting the instructor Derek Skapars he informed me the quantity designates the seats. Since the class is supposed to be taken by my girlfriend and I that pushes the price to 300. This is outside my monthly spending limit. I will have to catch the class at a future date. I am requesting a refund.\r\n\r\nThanks,\r\nJose ", "from_email": "j.tenorio.egr@hotmail.com"}}, {"pk": 25, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Nick Lagalante", "message": "Hi, \r\n\r\nI'm a recent remote worker transplant to Houston from DC, I run PR for a successful IT security software company and am looking for a co-working space I can spend a day or two a week at to change things up from my home office. So far your price is right, but do you offer any private rooms or areas for business calls during the day? Please advise. The co-working options here are slim and I could use a friendly atmosphere to spend a few days at! :-)\r\n\r\nBest regards,\r\n\r\nNick", "from_email": "nlagalante@gmail.com"}}, {"pk": 26, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Vicky Jean", "message": "Good Morning,\r\n\r\nDo I have to be a member to attend any the classes?\r\n\r\nThanks,\r\n\r\n\r\n", "from_email": "vjean02@gmail.com"}}, {"pk": 27, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Jordan Johnson", "message": "I am in the process if organizing a technology event for the Mickey Leland College Prep academy and would like to speak with someone in regards to cost/availability. \r\n\r\nAudience: 100 boys (5-6 classes)\r\nDate: March 28th\r\nTime : 9-12 AM\r\nLocation:Mickey Leland College Prep Academy for Young Men\r\nClass: 3D Printing Demo/Class\r\n\r\n\r\nJordan Johnson\r\n713-212-9843\r\n", "from_email": "jordan_johnson05@yahoo.com"}}, {"pk": 28, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Akram Anoushehi", "message": "I am an educator who love to see your place. I know you have an open house on Fridays afternoon.  I was wondering if I can come during the day to visit your lab.\r\n\r\nThank you,\r\nAkram", "from_email": "aanoushehi@sjs.org"}}, {"pk": 29, "model": "contact.message", "fields": {"user": 2992, "subject": 2, "from_name": "davidvan10", "message": "To Whom It May Concern,\r\n\r\nI am interested in attending some of the woodworking classes you have/will have available in the future and wanted to know what the typical course progression is. I noticed that some classes authorize the student to attend others (such as Woodworking Tools and Adirondack Chair) but wasn't quite sure what the correct order is. Any help or clarification you could provide would be greatly appreciated. Please feel free to call me at 972-896-6259 or email me at the address provided. Thank you.\r\n\r\nDavid Van Vranken", "from_email": "essayons3.6@gmail.com"}}, {"pk": 30, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Nicholas Gros", "message": "I am taking the Woodworking: Adirondack Chair Making class this weekend. I wanted to make 2 chairs, is there any way I could pay for extra materials so that I could do that?\r\n\r\nThanks,\r\nNick", "from_email": "nick76_tx@yahoo.com"}}, {"pk": 31, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "McKenzie Gamez", "message": "Hello, This message is for Roland. I took Welding I about two weeks ago and went ahead and signed up for Welding II for this Saturday. Is there any way to come in to practice this Thursday or Friday evening? I appreciate it.\r\n-McKenzie G.", "from_email": "mckenzie_gamez@outlook.com"}}, {"pk": 32, "model": "contact.message", "fields": {"user": null, "subject": 3, "from_name": "Cody Tapscott", "message": "Does TXRX Labs have any PCB milling equipment available?\r\n\r\nThanks,\r\nCody", "from_email": "cat10@rice.edu"}}, {"pk": 33, "model": "contact.message", "fields": {"user": 2816, "subject": 4, "from_name": "Melissa", "message": "Hi there,\r\n\r\nI was scheduled for the DSLR class this past Saturday, however, at the last minute, I was unable to attend due to a back injury.  I was wondering if I could reschedule as I was really looking forward to this class.", "from_email": "melissa77029@hotmail.com"}}, {"pk": 34, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "Brandon Stewart", "message": "So I registered on your website. Username: brandons885 . Email: brandons885@hotmail.com . Password: stewart1. I tried to register for a class and it said I needed to log in. I entered in the username and password listed above and I received an error message “username and password do not match”. Then I went to go reset my password. I asked me for my email address to reset my password. I entered in the email address listed above as requested. I then received the error message stating “ no email address matching this name”. So then I thought I may have not registered correctly. So I went back to register on the site and when I entered in the same information above I then was notified that the email address brandons885@hotmail.com and user name brandons885 were already being used. I am like a dog chasing its own tail. It shows that I am registered with email address brandons885 but can not log in because the email address is not recognized. ", "from_email": "brandons885@hotmail.com"}}, {"pk": 35, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "paul king", "message": "Will come by on Friday 3-13-14 have small project", "from_email": "paul.king@americanarches.com"}}, {"pk": 36, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "carlos marin", "message": "I wanted to register to the class inventor 2 weeks ago but class was full.   I'm really interested if possible to possibly maker space for me I would appreciate it.\r\n         \r\n     Thank you..", "from_email": "lakerz1bby@gmail.com"}}, {"pk": 37, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Omar Mendoza", "message": "Hello,\r\n\r\nI registered for two persons to the Inventor 3-D CAD on 03/28/2015, and I noticed that this class is NOT in the Calendar.\r\nIs the class cancelled?\r\nThanks for your support.\r\n\r\nBest Regards,\r\nOmar I. Mendoza", "from_email": "oimendoza@gmail.com"}}, {"pk": 38, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Laura Beth Mertz", "message": "Good afternoon!\r\n      I am work for an architecture firm downtown and we are designing a dress for the IIDA Product Runway 2015 competition, which requires us to construct a dress out of architectural materials. We are wanting to punch holes in some plastic strip that we have and really would only need use of the drill press for a one or two time use. Is there something available for this? We do not really need a monthly or yearly tinker membership. Thank you so much for your help! \r\n\r\n- Laura Beth Mertz", "from_email": "lmertz@pdrcorp.com"}}, {"pk": 39, "model": "contact.message", "fields": {"user": null, "subject": 3, "from_name": "test", "message": "Test", "from_email": "1ronnie1@gmail.com"}}, {"pk": 40, "model": "contact.message", "fields": {"user": 2174, "subject": 4, "from_name": "omar5687", "message": "Recently signed up for the Tool Sharpening class and paid via paypal.  Got 2 emails saying a new account was created for me one with the my username I've been using and a second with a new username \"based on my email\"  The class appears under the new username mentioned in the 2nd email instead of my current username which also shares the same email.  The usernames are omar(the newly created one) and omar5687(the one I've had) \r\n\r\nhttp://imgur.com/IINwInP  < Screen shot of how the messages were received.  First one had the account created for omar5687 and second contained account created for omar.  I tried to use the reset link for omar5687 and got an expired error while the one for omar let me create a password/account.", "from_email": "Omar@nuodesign.com"}}, {"pk": 41, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Greg plosk", "message": "Hello when is your 2015 class for building a Quad.   what is the cost for your Class.    Thank you", "from_email": "dynotime1@yahoo.com"}}, {"pk": 42, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Haley ", "message": "I am interested in using Photoshop CS6 to create textile designs and print them on fabric. Do you have the necessary equipment / software in order to accomplish this? Do you offer any classes on fabric design? \r\n\r\nThank you! \r\nHaley Huckin\r\n\r\n713-384-4010", "from_email": "hhuckin@gmail.com"}}, {"pk": 43, "model": "contact.message", "fields": {"user": 1917, "subject": 2, "from_name": "Beth Weissinger", "message": "Can I be wait listed for the 4/4 joinery class?", "from_email": "Elizabeth.weissinger@aggienetwork.com"}}, {"pk": 44, "model": "contact.message", "fields": {"user": 1917, "subject": 2, "from_name": "Beth Weissinger", "message": "Can I be wait listed for the 4/4 joinery class?", "from_email": "Elizabeth.weissinger@aggienetwork.com"}}, {"pk": 45, "model": "contact.message", "fields": {"user": 1917, "subject": 2, "from_name": "Beth Weissinger", "message": "I'd like to take the 4/4 Joinery class.  Is there a wait list?", "from_email": "Elizabeth.weissinger@aggienetwork.com"}}, {"pk": 46, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Doug Desenberg", "message": "Hi,\r\nMy name is Doug Desenberg. I am a close friend of Michelle Haslam. I stopped by TX/RX earlier this week to give MIchelle a ride home and was blown away with what I saw.I also was briefly introduced to Ronald, who gave me a quick tour.  I've been fascinated with the whole maker/hackerspace movement, particularly 3-D printing, ever since I first came across it. I know that Michele had  been doing odd jobs and organizational tasks  for TR/RX before she  had to leave suddenly and return to England. I would really like to take over her duties and would do so passionately. I had dropped off a copy of my resume and a cover letter at TX/RX earlier today, to the attention of Roland Von Kurnatowski. I asked the gentleman who was there at the time for Roland's email address and he suggested I reach out through the Contact form on the website. Please forward this message to Mr. Kurnatowski or the appropriate person. I am available to start as soon as Saturday (tomorrow) and have pasted the cover letter hereto.\r\n\r\nThank You!\r\nDoug Desenberg\r\n347-585-0404\r\njddny@mac.com\r\n\r\nText of Cover Letter:\r\nRoland Von Kurnatowski III\r\nExecutive VP\r\nTX/RX Labs\r\n\r\n\r\nDear Roland,\r\nPlease consider me to replace Michelle Haslam in the position she is departing at TX/RX. I am very qualified to do the job. One thing that I feel makes me an especially good fit is that I have been quite fascinated by the maker movement, particularly 3-D printing for quite a long time. This will bring  lot of natural  passion and interest to every task at hand. For example, Michelle mentioned the other day that she had recently been tasked with sitting in on several of the classes offered at TX/RX and developing written course materials. Any such project would be a labour of love for me! I am very flexible as to work schedule, including nights and weekends (even holidays)  and available to start work immediately. \r\n\r\nI read the  interview posted on the TX/RX website about SchoolBot and your pilot program to make 50 SchoolBots and  put  them in local high schools. That is really cool and something I would really love to assist with, both as an employee and on my own time as a volunteer. I recently moved to Houston from New York, but I grew up here, know a lot of wealthy like-minded Houstonians and might be very useful in your fundraising efforts.  I hope to meet you soon.  \r\n\r\nSincerely,\r\n\r\n\r\n \r\nDoug Desenberg\r\n347-585-0404\r\njddny@mac.com  \r\n", "from_email": "jddny@mac.com"}}, {"pk": 47, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "alicia", "message": "I don't have a fancy project to work on, just building a computer. Are there communal spaces to work on simple projects like that? I don't have a need for a membership, but are there daily fees or a table I could rent?", "from_email": "ajimenes_14@sbcglobal.net"}}, {"pk": 48, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Shannon", "message": "Roland,\r\nI have been trying to contact you with the email addresses I have for you and I do not know if you are getting them.  I have been out of town working for the past few months and have not been able to stop by and discuss some questions I have about the work I did for you.  I would like an email address to talk with you because I am not sure when I will be able to stop by again.\r\nI came by on my way through town a couple of weeks ago to pick up my bike frame and talk to you but you were teaching a class. Could you please send me an email with the address I can talk with you at.\r\nShannon", "from_email": "se03@mail.com"}}, {"pk": 49, "model": "contact.message", "fields": {"user": 2228, "subject": 5, "from_name": "kr579", "message": "Hi,\r\n\r\nI need to cancel my enrollment in 2D CAD/Drafting (March 21,22) and Inventor 3-D Computer Aided Design (March 28,29,April 4) due to travel.\r\n\r\nThanks,\r\nKaren Rust", "from_email": "kar.rust@gmail.com"}}, {"pk": 50, "model": "contact.message", "fields": {"user": 2228, "subject": 5, "from_name": "kr579", "message": "Hi,\r\n\r\nI need to cancel my enrollment in 2D CAD/Drafting (March 21,22) and Inventor 3-D Computer Aided Design (March 28,29,April 4) due to travel.\r\n\r\nThanks,\r\nKaren Rust", "from_email": "kar.rust@gmail.com"}}, {"pk": 51, "model": "contact.message", "fields": {"user": null, "subject": 5, "from_name": "Andrew Bartell", "message": "Hey TXRX team, I am unable to attend your woodworking furniture building class this Saturday and Sunday from 9 a.m. to 5 p.m. How can I get a refund for these courses I won't be attending? I look forward to your response.", "from_email": "andrewsbartell@gmail.com"}}, {"pk": 52, "model": "contact.message", "fields": {"user": 3024, "subject": 5, "from_name": "sconner1948", "message": "I am scheduled for the Arduino class on March 15, but have taken ill.  If you post the vacancy soon, some one else might be able to attend.", "from_email": "sconner1948@hotmail.com"}}, {"pk": 53, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Jason", "message": "Good afternoon!\r\nI signed up for 3D printing class tomorrow and I won't be able to make it.\r\nCan I reschedule for another class or get a refund for that and just hold it off until I find another suitable schedule?\r\nThank you", "from_email": "jkoh4580@gmail.com"}}, {"pk": 54, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Jason", "message": "Good afternoon!\r\nI signed up for 3D printing class tomorrow and I won't be able to make it.\r\nCan I reschedule for another class or get a refund for that and just hold it off until I find another suitable schedule?\r\nThank you", "from_email": "jkoh4580@gmail.com"}}, {"pk": 55, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Jason", "message": "Good afternoon!\r\nI signed up for 3D printing class tomorrow and I won't be able to make it.\r\nCan I reschedule for another class or get a refund for that and just hold it off until I find another suitable schedule?\r\nThank you", "from_email": "jkoh4580@gmail.com"}}, {"pk": 56, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Jason", "message": "Good afternoon!\r\nI signed up for 3D printing class tomorrow and I won't be able to make it.\r\nCan I reschedule for another class or get a refund for that and just hold it off until I find another suitable schedule?\r\nThank you", "from_email": "jkoh4580@gmail.com"}}, {"pk": 57, "model": "contact.message", "fields": {"user": 2508, "subject": 4, "from_name": "jpvu", "message": "I didn't want to put this on the member forum, but there didn't seem to be an event on the calendar about the Houston Public Library event, so I was quite surprised to see all the printers gone. Someone said it was on the Facebook, but I don't really check fb that much. Barring when machines unexpectedly break, it does take me a while to drive to TXRX, so I was disappointed to find that I couldn't print anything. I was wondering, for the future, could organizers be more mindful about posting events to the calendar page? \r\n\r\nOne issue was that I had two rolls of filament (one on the Makerbot, one on the Weistek) and they were taken with the rest of the machines. I had my name on both rolls, and I didn't know how to contact anyone at TXRX about this, besides using the General Contact form. ", "from_email": "jpvu@ymail.com"}}, {"pk": 58, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "marcelino", "message": "I can't seem to register with my username (marcelino) and my email above. system tells me my email is already in use. When I try to reset the password it says the email is not associated with any account. \"That email address doesn't have an associated user account. Are you sure you've registered?\"\r\n\r\nI need help to set up an account. Any suggestions?\r\nMarcelino", "from_email": "marcelino90@hotmail.com"}}, {"pk": 59, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "clifford rhodes", "message": "Hi!\r\n\r\nI was thinking about joining.  Is there a Lase Engraver available?  If so, what size products in height and width can it handle at the most?  Can it engrave a logo?\r\n\r\nThanks,\r\n\r\nClifford Rhodes", "from_email": "clifford@thecompressorwarehouse.com"}}, {"pk": 60, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Mike Forest", "message": "Hello!\r\nI'm reaching out to the Maker World to inform you that A Major Cable Network is looking for Makers, Inventors and Garage Tinkerers to show off their skills and creativity on a New Competitive Reality Show!!!\r\n\r\nI've previously cast \"Face Off\" and \"Jim Henson's Creature Shop\" for SyFy as well as \"Framework\" for Spike,\" so I'm comfortable with shows that deal in the creative/build space\r\n\r\nOn each episode the show, 6 Makers will put their skills to the test on a the National Stage!\r\n\r\nYou will be asked to design and build new and necessary projects that will show our Top Notch Judges and the viewing audience at home, your unique talent, creativity and technical skills!\r\n\r\nObviously, I cast TV shows and this is not my world, so any help you could give me to point me in the right direction would be greatly appreciated. I wouldn't want anyone suited for our show to miss out on this amazing opportunity.\r\n\r\nFeel Free to Email me or Call me with any leads or suggestions! Or for an Application!\r\n818-666-3606", "from_email": "makers@pitmancasting.com"}}, {"pk": 61, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Joe Koronowski ", "message": "Hi. I'm interested in using the conference room 1-2 hrs per week to collaborate with my biz partner. Which membership should I join?the $10/month? \r\nI will also join as a hacker later on. \r\nIt will be at non busy times during week at 1-3 timeframe.\r\nIf like to start 3/17\r\nJoe \r\n281-686-7771\r\n", "from_email": "Joeski62@gmail.com"}}, {"pk": 62, "model": "contact.message", "fields": {"user": 2062, "subject": 5, "from_name": "mccallum.cheryl", "message": "I can't make the Soldering II class.  Can you please refund that one for me?  Thank you!\r\n\r\nCheryl", "from_email": "mccallum.cheryl@gmail.com"}}, {"pk": 63, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Tom", "message": "I work in Houston 5days a weak and would like do woodworking projects on my time off. Can you help?", "from_email": "tomp1229@gmail.com"}}, {"pk": 64, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Naren Anand", "message": "I am a member of VUUM ( http://www.vuum.com/ ), a startup formed by soon-to-be PhDs  in the Electrical Engineering department at Rice University.   We develop long range, packet based,  UHF-band transmission devices (Super WiFi http://en.wikipedia.org/wiki/Super_Wi-Fi ) and we are currently focusing on the academic research market.  In order to test how well our systems work in real deployments, we need to build an enclosure that will house our equipment while still being weather-proofed.  We have some off the shelf weatherized enclosures but we still need to make the acrylic backplate that all of our hardware mounts onto before going into the enclosure.  To do this, we need to laser cut 1/4\" acrylic sheets into a design we already have and have tested on other laser cutters in the past.  If we purchase memberships to your lab, can we use your facilities under your guidance to laser cut our designs?  Please feel free to contact me with any further questions you may have at nanand@rice.edu  Thank you for your time.", "from_email": "nanand@rice.edu"}}, {"pk": 65, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Kristiaan", "message": "Just wanted to know if I need to reserve a space or anything for Friday night open house? Planning on attending. Have some project ideas and my friend recommended TXRX. \r\n\r\nThanks,\r\nKristiaan", "from_email": "kristiaanjoseph@gmail.com"}}, {"pk": 66, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Max Alpert", "message": "Hi,\r\n\r\nI am very interested in learning how to woodwork, the first step being the Woodworking Tools I class. However, I observe the Jewish Sabbath, which begins Friday night sunset (at this time of year around 7:00pm) and ends Saturday night after sundown (at this time of year around 8:00pm), making attending these classes difficult to impossible. \r\n\r\nI was pleased to see that the May class had a Sunday session, however, I still cannot attend due to the duration of the Friday evening class. \r\n\r\nIs it possible to arrange a make-up session at another time? I understand that this may require an increased price. I would sincerely appreciate the accommodation.\r\n\r\nSincerely,\r\n\r\nMax Alpert ", "from_email": "max.s.alpert@gmail.com"}}, {"pk": 67, "model": "contact.message", "fields": {"user": 2729, "subject": 4, "from_name": "Crispix396", "message": "Help, i was wondering if you have contact information for the Airbrush teacher (summer).  I took the sunday class and afterward, i cannot find my Camera bag.  So I either left it in the classroom, or possibly it was stolen out of my car.  Trying to narrow it down.  Thank you.", "from_email": "crispix396@gmail.com"}}, {"pk": 68, "model": "contact.message", "fields": {"user": 2988, "subject": 2, "from_name": "Ashowers", "message": "I’m signed up for the welding I class tomorrow and didn’t realize I already have a commitment. Can I move to the next available class instead - looks like April 9 would be the next one.\r\n\r\nRegistration under:\r\nApril Showers\r\napril.showers@gmail.com", "from_email": "April.showers@gmail.com"}}, {"pk": 69, "model": "contact.message", "fields": {"user": 3015, "subject": 2, "from_name": "dfett2003", "message": "Hi - I'm scheduled for the airbrush class this sunday (2nd half) but will have to miss it.. i had to change some weekend plans around so I could take the Linux CNC on saturday..   would i be able to catch the 2nd day of airbrush at another time?  I understand that'd be based on space..  even if not, i learned enough in the 1st class to work with..\r\n\r\nThanks\r\n\r\nDarryl Fett\r\n", "from_email": "dfett2003@hotmail.com"}}, {"pk": 70, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Sarah Raymer", "message": "Hello- I have spoke briefly to Roland and we got disconnected. I am looking to secure a reservation in the conference room. \r\nI have been quoted a price and am ready to make a deposit but am just waiting on a pay pal link to pay a deposit. \r\nRoland said he would send me a link to pay but I have not received one as of yet.\r\nThis is a time sensitive matter- just pushing all avenues of communication due to the urgency of my timeline.\r\nI am really hoping for a secured space by this evening if at all possible. \r\n\r\nThank you- \r\nSarah Raymer\r\n512-299-1299\r\n", "from_email": "sraymer@solpowerpeople.com"}}, {"pk": 71, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Barbara", "message": "Digital Photography 1:  Understanding Your DSLR  - 1 Open Session. What does that mean?  I have two persons who would like to take this class.", "from_email": "bhanson@dtk-group.com"}}, {"pk": 72, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Ricardo Estrada ", "message": " I have to downgrade my membership 145 table to a 50$   Membership . If there something else I need to do please call me or text me at 713-201-5973 thank you", "from_email": "Ricmaetinez79@yahoo.com"}}, {"pk": 73, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Ricardo Estrada ", "message": " I have to downgrade my membership 145 table to a 50$   Membership . If there something else I need to do please call me or text me at 713-201-5973 thank you", "from_email": "Ricmaetinez79@yahoo.com"}}, {"pk": 74, "model": "contact.message", "fields": {"user": 3092, "subject": 2, "from_name": "mach", "message": "Hello\r\n\r\nI recently joined and would like to begin using the welding lab.  Can I jump directly to MIG 2?  I have completed 3-4 projects with my own small MIG welder.  I also have hobbyist level experience with TIG, oxy/acetylene welding, and oxy/propane brazing.\r\n\r\nThanks\r\n\r\nAlvin Barber", "from_email": "alvinb@gmail.com"}}, {"pk": 75, "model": "contact.message", "fields": {"user": 2661, "subject": 2, "from_name": "gjfletch", "message": "I was scheduled to take the CNC Linux class today 3/21/15 and was stuck in traffic on I-45 for over two hours. When I finally arrived at the class there was absolutely zero chance of me catching up. I spoke with Roland and he asked me to contact you so I would be able to take the course when it is offered at a future date using the tuition I paid for this class.  Please advise.\r\n\r\nSincerely,\r\n\r\nGayle Fletcher ", "from_email": "gjfletch@suddenlink.net"}}, {"pk": 76, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Kenichi Higashijima", "message": "Dear who may be concered,\r\n\r\nI don't have a membership at this moment.\r\nIs it necessary to have membership to participate in any of following classes?\r\n- Leather Working I (https://www.txrxlabs.org/classes/110/leatherworking-i/)\r\n- Leather Working II (https://www.txrxlabs.org/classes/167/leatherworking-ii/)\r\n- Leather Working: Wallet Making (https://www.txrxlabs.org/classes/131/leatherworking-wallet-making/)\r\n\r\nKenichi Higashijima", "from_email": "kh200912@gmail.com"}}, {"pk": 77, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Tim Sefton", "message": "Hi,\r\nI'm looking at relocating, possibly to the Houston area and am interested in your hackerspace.  I'm currently a member at Tech Shop in Detroit Michigan.  Have a couple of questions for you.  Regarding access to the tools - most of my work is with metal shop (welding, cutting, milling and lathe),  \r\n \r\n1)  Is there a check out / testing process for getting access to each of the tools once your a member ?  \r\n2)  Is there a limit to the hours per day or per week that you can spend on a tool ?\r\n3)  Is there a reservation system for each tool ?\r\n4)  Do you have any after hours access to the tools ?\r\n5)  I didn't notice a shop bot at your facility - is there some type of CNC router ?  Can it handle a 2\" piece of foam.\r\n6)  I noticed, tig machine, metal lathe, milling machine, and some type of CNC plasma cutter on your web site are those tools still available at your space ?\r\n\r\nThanks so much for your feedback.\r\nYours,\r\nTim Sefton\r\n", "from_email": "tim.sefton@gmail.com"}}, {"pk": 78, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Sebastian Gomez de la Torre", "message": "Hi,\r\nMy name is Sebastian and I'm an illustrator. I just took my first class yesterday/visited the labs for the first time. I had a great sewing class. I took a look around and noticed the computer room - long story short, I was wondering how to go about teaching a class. My work is primarily digital so I know Photoshop and illustrator. I was thinking I could teach a digital painting photoshop class or an illustrator class. Is that something that fits into the Hackerspace curriculum? The computer lab really lends itself well to teaching a class like that. \r\nYou can see my work at illseabass.com - please let me know.\r\nThanks! ", "from_email": "seb@illseabass.com"}}, {"pk": 79, "model": "contact.message", "fields": {"user": 2705, "subject": 5, "from_name": "ggerold", "message": "I will not be able to make it to the inventor class on March 28 29 and April 4th and need to cancel. \r\n\r\nRegards,\r\nGreg ", "from_email": "gregerold@gmail.com"}}, {"pk": 80, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Sheryl Astrup", "message": "Do you take donations? I have a Paragon electric Kiln and a pottery wheel that I would like to donate. I would just request that it be picked up from its current location. Thank you for your time. I can be contacted at 281-772-0045.", "from_email": "firstclassgal@earthlink.net"}}, {"pk": 81, "model": "contact.message", "fields": {"user": 2881, "subject": 2, "from_name": "lhamaker", "message": "Hi Roland,\r\n\r\nWhen I left for the day on Sunday it looked like my ink well 3D print design (LKH....thng file) was printing pretty well.  Some of the photos of the finished product showed a tea light candle inside of the object when it was printed in white/clear plastic.  it looked pretty cool so I hope to be able to print it again sometime in the translucent color.  I look forward to picking it up this week.  If it is done before Friday let me know as I live close by.\r\n\r\nThanks for all your help as I really enjoyed the 3D printing class!\r\n\r\nLinda", "from_email": "lhamaker@vitalvantage360.com"}}, {"pk": 82, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Sean Jump", "message": "I have a team (~20 people) who will be in Houston for (2) weeks in April. We are a fairly nerdy group from Ernst & Young and I was curious about any team building events that you may offer?\r\n\r\nThanks in advance!", "from_email": "seanjump@gmail.com"}}, {"pk": 83, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Scott Reese", "message": "Hi,\r\n\r\nI am interested in learning to use the metal lathe and milling machine.  I see that you offer classes, but they are full.  Is it possible to get one-on-one training or small group training?  \r\n\r\nThanks in advance,\r\nScott", "from_email": "rscott.reese@gmail.com"}}, {"pk": 84, "model": "contact.message", "fields": {"user": null, "subject": 5, "from_name": "Robert Chrisman  (Bobby)", "message": "Hi. I registered for welding 1 this Saturday but I got called in for a work shift. I dont necessarily want a refund, but to register for another date, April 16th if its still open. How can i do this?\r\n\r\nThanks, Bobby", "from_email": "bbchrisman@gmail.com"}}, {"pk": 85, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Jackson Keating", "message": "I've switched email addresses.  Could you add jackson.keating@gmail.com to the members google groups?  Currently, I have to use my previous email address awesomecoolguy@gmail.com.\r\n\r\nThanks,\r\nJackson", "from_email": "jackson.keating@gmail.com"}}, {"pk": 86, "model": "contact.message", "fields": {"user": 3023, "subject": 5, "from_name": "Torinnrp", "message": "I didn't mean to select this particular class.  Please cancel this reservation and refund and I will rebook the class I inteneded to.\r\n\r\nThanks!", "from_email": "Evan@eggersmannusa.com"}}, {"pk": 87, "model": "contact.message", "fields": {"user": 2174, "subject": 4, "from_name": "omar5687", "message": "If possible I need a cancellation of Plasma Cutting on 4/18 I have a conflicting event.  Thank You.", "from_email": "Omar@nuodesign.com"}}, {"pk": 88, "model": "contact.message", "fields": {"user": 1341, "subject": 4, "from_name": "Lane Shutt", "message": "I would like to schedule a time to get checked out on several tools. If possible I would like to do it this weekend, 28-29 March. Sunday would be best for me but Saturday afternoon is OK. I work second shift so weekends are the only time I can get to the lab. If this weekend is unavailable I would like to schedule it for the next available weekend time.\r\n\r\nThe machines I would like to be checked out on are the\r\nCNC Router\r\nmanual and CNC mills\r\nLathes.\r\n\r\nI'm a cnc machinist (not a button pusher) and have my own manual machines though not as large as what the lab has. I have completed the Linux CNC course.\r\n\r\n--\r\nLane ", "from_email": "lmshutt@hiwaay.net"}}, {"pk": 89, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "George Danner", "message": "Hi--\r\n\r\nI just want to confirm that you will be having Open House this evening at 7pm?  I am bringing my 17 year old son to see the place.\r\n\r\nThank you,\r\n\r\nGeorge Danner", "from_email": "george.danner@business-laboratory.com"}}, {"pk": 90, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "PATRICK HARRIGAN", "message": "\r\nWHAT IS YOUR PHONE #   ? \r\n\r\n \r\n 504   233  8913  \r\n\r\n ", "from_email": "MANDEVILLE752@GMAIL.COM"}}, {"pk": 91, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "PATRICK HARRIGAN", "message": "\r\nWHAT IS YOUR PHONE #   ? \r\n\r\n \r\n 504   233  8913  \r\n\r\n ", "from_email": "MANDEVILLE752@GMAIL.COM"}}, {"pk": 92, "model": "contact.message", "fields": {"user": 2862, "subject": 5, "from_name": "Morgan S", "message": "Good afternoon, \r\n\r\nI need to cancel the powder coating class as I have a schedule conflict that I hadn't taken into consideration. Can I still get refunded for the class?\r\n\r\nBest, \r\nMorgan Sean", "from_email": "m_mccright85@hotmail.com"}}, {"pk": 93, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Andrea Brooks", "message": "Attended your open house tonight, my interest is to collaborate with 3D or plastic molding designer that will assist me in developing a prototype sample for a presentation, please advise, my contact # 832-894-2744,thank you", "from_email": "andreaanitabrooks57@yahoo.com"}}, {"pk": 94, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Andrea Brooks", "message": "Attended your open house tonight, my interest is to collaborate with 3D or plastic molding designer that will assist me in developing a prototype sample for a presentation, please advise, my contact # 832-894-2744,thank you", "from_email": "andreaanitabrooks57@yahoo.com"}}, {"pk": 95, "model": "contact.message", "fields": {"user": 3128, "subject": 2, "from_name": "holmosapien", "message": "Is the woodworking class required to gain access to the woodshop? When is he next class -- after the full class on April 10 -- going to be scheduled? Is there a means to \"test out\" for those with experience with the equipment they'll be using?", "from_email": "txrx@holmosapien.com"}}, {"pk": 96, "model": "contact.message", "fields": {"user": 3054, "subject": 2, "from_name": "gfriend", "message": "Hi,\r\n\r\nI registered for the wood lathe class on April 25 on behalf of my boyfriend (it's his birthday present). Can you change the name on the list (or whatever you have) from Grace Friend to Cody Bird? Thanks!", "from_email": "gracekfriend@gmail.com"}}, {"pk": 97, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Sangee", "message": "Hello\r\n\r\nCan you please let me know the open house hours for this Friday (the 3rd) with it being Good Friday.\r\n\r\nThanks\r\nSangee", "from_email": "parsan99@yahoo.com"}}, {"pk": 98, "model": "contact.message", "fields": {"user": 2816, "subject": 2, "from_name": "melissa77029", "message": "Hi there,\r\n\r\nI spoke with someone last month about rescheduling a two classes I had signed up for in March.  I, unfortunately, had to cancel my classes due to doctor-ordered bed rest and a severely pinched nerve.  I see that there the same classes have some availability in April and was wondering if I could get fit in for those? \r\n\r\nThe classes are:  Bike Maintenance on April 4, and DSLR on April 25.\r\n\r\nThanks for your time!", "from_email": "melissa77029@hotmail.com"}}, {"pk": 99, "model": "contact.message", "fields": {"user": null, "subject": 3, "from_name": "Spencer Carmichael", "message": "Last time I came to the workshop the laser cutter was out of order; I was wondering: is it up and running yet?", "from_email": "spencer.carmichael@gmail.com"}}, {"pk": 100, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Nicolas Buforn", "message": "Dear Sir/Madame, \r\n\r\nI reached your website looking for metal fabrication shops... I'm really interested in your welding courses (I&II). \r\n\r\nJust to know a bit of my background, I am Product & Furniture Designer. I did an MA in Furniture Design and Technology in London where I developed some metal projects. I was involved in the design and the whole production. The only thing I couldn't do, because of security reasons, was to weld; however I have been always helping in the welding shop meanwhile the technician was doing his job...  \r\n\r\nI've checked your calendar and there are two dates that fits my calendar... April 9th and April 16th, although I know both are full... \r\nIs there any way to join that session or to be in a waiting list? \r\nA part from May, are you thinking to include any other session? \r\n\r\nThe same happens with Welding II session... I can't attend May ones but I am completely free for April 25th one... \r\n\r\nI will really appreciate if you can give me advise about the session and let me know if I can join April's sessions.\r\n\r\nThanks in advance \r\nWith Kind regards\r\nNicolas Buforn ", "from_email": "nbuforn@gmail.com"}}, {"pk": 101, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Taylor eiteman", "message": "im looking in particular for someone to work with me on some lathe/mill work for a project i have. I was referred to your facility via reddit. Its more on the lines of a small production run. Would txrx be a suitable choice on the matter? Maybe you could refer me to someone specific? \r\n\r\nThanks for your time.", "from_email": "taylor.eiteman@att.net"}}, {"pk": 102, "model": "contact.message", "fields": {"user": 3112, "subject": 4, "from_name": "phookstx6", "message": "I just paid for 2 students to attend the 3 d printing class next weekend.  I paid and then I signed up for a Paypal account and paid through Paypal.  Would you please confirm that only one payment of $130 is taken and not 2 payments of $130?  It looks like 2 payments were made  - one via online and then another payment via Paypal.  Please confirm.  \r\n\r\nThanks for your help.  \r\nPatricia Day \r\n(281) 923-9228 ", "from_email": "info@teachmiiz.com"}}, {"pk": 103, "model": "contact.message", "fields": {"user": 3161, "subject": 4, "from_name": "bspivey", "message": "Hello, I would like to begin woodworking at the end of this month. I see that the April and May classes are full. Can I become and member and be certified to use the woodshop without taking this class or by one on one instruction?\r\n\r\nBen", "from_email": "ben.spivey@gmail.com"}}, {"pk": 104, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Sara Hilburn", "message": "Good afternoon!\r\n\r\nI am a coordinator for Texas Linux Festival 2015 and I am reaching out to your company to see if you would be interested in sponsoring us this year. May I request contact information for your PR/Marketing department? I would like to send you an official email containing information about the festival, including our sponsorship prospectus. \r\n\r\nThank you for your time!\r\nSara Hilburn\r\nTXLF Coordinator\r\nPH: 830-302-1719\r\nEmail: sara@texaslinuxfest.org\r\nhttp://www.texaslinuxfest.org", "from_email": "sara@texaslinuxfest.org"}}, {"pk": 105, "model": "contact.message", "fields": {"user": 3131, "subject": 2, "from_name": "whinesley", "message": "I signed up for the Plasma Cutting class to be held April 18.  Although I have a receipt from PayPal confirming the payment, I am not showing up as enrolled on the https://txrxlabs.org/classes/ web site.  \r\n\r\nI wanted to verify that all is well and that I am on the list to attend this class.\r\n\r\nThank you.\r\n\r\nWilliam Hinesley\r\n", "from_email": "william.c.hinesley@swbell.net"}}, {"pk": 106, "model": "contact.message", "fields": {"user": 3139, "subject": 5, "from_name": "Colin O", "message": "Hello,\r\n\r\nI signed up for a few classes and I'm currently a Amigotron member as of earlier today. Is there something I need to do first to get the 5% off for the classes I've enrolled in so far?\r\n\r\nThank you,\r\n\r\nColin O'Neill", "from_email": "colinoneill.me@gmail.com"}}, {"pk": 107, "model": "contact.message", "fields": {"user": 2327, "subject": 5, "from_name": "Paul-Bryan", "message": "Hi, I had paid for the LinuxCNC. Streetcam and the Vertical mill classes.  I realized that I miss the LinuxCNC class yesterday 4-5-2015. After looking at my schedule I cannot make the Streetcam class on 4-19-2015 or the vertical mill class on  7-20 and 7-21 that I paid for also. I would like a refund on the two remaining classes. Please reply and let me know if is completed.\r\n\r\nPaul Bryan", "from_email": "kron344@yahoo.com"}}, {"pk": 108, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "MIchael Cleveland", "message": "Must I be a member to take welding I class?", "from_email": "m999cleveland@gmail.com"}}, {"pk": 109, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "Carter Newton", "message": "I gave my  brother (Stephen Newton) a years subscription to your shop. I may want to renew it if he has been using it. Can you advise me if he still has time running on his one year class subscription. Thank you\r\nCarter Newton (brother) \r\n520 631 8194", "from_email": "carternewton@comcast.net"}}, {"pk": 110, "model": "contact.message", "fields": {"user": 1940, "subject": 2, "from_name": "ojeda.jeanette", "message": "any chance you have an extra spot in the woodworking class? i have a credit since last year for a class i wasn't able to take and would like to see if I could make it in this one. please let me know thanks", "from_email": "ojeda.jeanette@gmail.com"}}, {"pk": 111, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Nick Weinberg", "message": "Dear TXRX Labs,\r\n\r\nMy name is Nick Weinberg and I work on the Community Team at littleBits. We saw how passionate you are about creating workshops and classes for your community and wanted to tell you more about a new program we just launched last week. The new initiative is called Global Chapters allows passionate makers (like yourself) to organize local littleBits events and put the power of electronics in the hands of your community.\r\n\r\nI'd love to tell you more about this and see if you're interested in becoming our Houston Chapter.\r\n\r\nIs there a time that works best for you?\r\n\r\nBest,\r\nNick\r\n", "from_email": "nick@littlebits.cc"}}, {"pk": 112, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "samer hamadeh", "message": "Hello,\r\n\r\nI'll be in Houston on 14 and 15 April on a business trip that has nothing to do hackersapces nor startups and I was wondering if I can drop by and see your hackerspace. \r\n\r\nWhere ever I travel I like to see how different people set-up and such facilities as we might be interested to do something similar in Saudi Arabia.\r\n\r\nKind regards\r\n\r\nSamer\r\n\r\nwww.alj.com", "from_email": "hamadehs@alj.com"}}, {"pk": 113, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Nicolas", "message": "Hi... \r\nI sent a message from your website and I haven't got any reply yet. My enquires were related to the welding courses. \r\nIs there any way to get a telephone number so I can call you directly? \r\nOtherwise, this is my number if you can give me a call.. \r\n(832)359-0348\r\n\r\nThanks in  advance\r\nBest regards\r\nNicolas", "from_email": "nbuforn@gmail.com"}}, {"pk": 114, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Steve Duke", "message": "Dear Sirs,\r\nI would like to provide to you and your classmates (at no charge) Autodesk HSM CAM software for Inventor and Solidworks. Can you please put me in touch with the correct person ?\r\n\r\nThank you,\r\nSteve Duke\r\nECAD, Inc.\r\n210-556-7871", "from_email": "steve.duke@ecadinc.com"}}, {"pk": 115, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "JAMES", "message": "I took welding 1 and 2 a while back and remember that we can come into the lab after we've taken those classes. Im looking to buy a mig welder of my own and wanted to try some of the machines again that I used in class. Or is that for members only?  \r\n\r\nThanks,\r\n\r\nJames \r\n713 927 1969", "from_email": "JAMESTERRACINA@GMAIL.COM"}}, {"pk": 116, "model": "contact.message", "fields": {"user": 3044, "subject": 2, "from_name": "judgev", "message": "My son is signed up for the 3d class on. Saturday, but may have a conflict.  Can I transfer the payment to a later class?", "from_email": "judgev@aol.com"}}, {"pk": 117, "model": "contact.message", "fields": {"user": null, "subject": 5, "from_name": "Juan Corzo", "message": "Good day to whom it may concern. \r\n\r\nI signed up for the DIY Concrete Countertops class, scheduled on 03/29/2015 at 4:00pm. However, when I went to TXRX Labs to take the class, I was informed that the class had been cancelled due to the instructor having to take the time to see a family member in need. They told me that the class was gonna be re-scheduled for another time, an that such would be announced in an email or so to all the people who signed up. \r\n\r\nHowever, I would like to know a bit more information about this. Due to my schedule, it was a bit difficult to find a class where I was available. So, with that said, I just would like to know of any plans on this re-scheduling, so that I can start making my timing plans ahead. In the situation where I could not make it to the class, I would like to know if the class payment would be refunded. \r\n\r\nI appreciate your attention on this, and patiently wait for your response.\r\n", "from_email": "jpjp.corzo@gmail.com"}}, {"pk": 118, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "David", "message": "Having trouble logging in and resetting my password.  Can you please reset my account?\r\n\r\n-Dave\r\ndphanks@gmail.com", "from_email": "dphanks@gmail.com"}}, {"pk": 119, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Jeanette Bocell", "message": "Hello Roland,  I took a welding 1 class from you a week or so ago.  Thought it was awesome!  If possible, wanted to know if I could come in this Saturday 11th to practice my skills!  Haha! I lack the skills!!!! Anyway, sorry for the short notice, but, just thought I'd ask!  Thanks, Jeanette", "from_email": "jyo713@comcast.net"}}, {"pk": 120, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Kristiaan", "message": "Hello TX/RX,\r\n\r\nIf I can't do the SolidWorks 1 class on the last Saturday ( May 30th), will it still be the same price?\r\n\r\nAlso, why did I register and I can't log-in no matter what I do? Is there a wait-time before logging in after registration?\r\n\r\nThanks,\r\nKristiaan", "from_email": "kristiaanjoseph@gmail.com"}}, {"pk": 121, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Deb Huston", "message": "Can you give me some information on your largest CNC machine?  How big is it?  Can it handle wood?", "from_email": "deb.huston@gmail.com"}}, {"pk": 122, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Deb Huston", "message": "Oh, and do you have a vacuum molder for plastic?", "from_email": "deb.huston@gmail.com"}}, {"pk": 123, "model": "contact.message", "fields": {"user": 3044, "subject": 2, "from_name": "judgev", "message": "My son cannot attend the class he is signed up for tomorrow.  Can I get a refund or transfer those funds to another class", "from_email": "judgev@aol.com"}}, {"pk": 124, "model": "contact.message", "fields": {"user": 1576, "subject": 2, "from_name": "Derek S", "message": "hello, this is derek the Adirondack chair making instructor. I was wondering when the next available weekend is for me to instruct this course again?", "from_email": "derekskapars@gmail.com"}}, {"pk": 125, "model": "contact.message", "fields": {"user": 1836, "subject": 5, "from_name": "disco_b", "message": "Hi,\r\nI am not requesting a refund, and I know it is very late notice - very late. Could I possibly attend this Woodworking class at the next scheduled time? My schedule is very unpredictable, and sometimes I don't have any choice but to rearrange prior engagements. \r\n\r\nThank you,\r\nS. McGilbert\r\n", "from_email": "smcgilbert@gmail.com"}}, {"pk": 126, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Lorin Symington", "message": "Are you interested in DIY clean energy? Climate change? World poverty?\r\n\r\nI’m passionate about DIY solar tech and the potential it has for helping billions of people around the world. Do you know why solar thermal hasn’t gone viral already? Because the option has either been small, simple solar cookers or huge complex solar installations. We’re about to change that with our crowdfunding campaign #FreeTheSun. Check out our campaign page at www.gosol.org/FreeTheSun but please keep the link private until April 15th. \r\n\r\nWe’re campaigning to release free construction guides for our scalable solar concentrator technologies as well as to build a collaborative development platform online so that Makers from around the world can contribute to the shared development and evolution of these game-changing technologies.\r\n\r\nTo do this, we’re launching a crowdfunding campaign on the 15th of April. Do you think there are members of your community interested in figuring out how to hook billions of people up with free solar energy? Would you help us spread the word come campaign time?\r\n\r\nA fantastic workshop can be created around the idea of solar concentration.\r\n\r\nOn Twitter we’re @GoSolOrg hashtagging #FreeTheSun and #HackSolar and we’re on at Facebook.com/gosol.org\r\n\r\nWe can’t do this without you, so please, share with your network. If you can think of any influencers or blogs who would be interested please get in touch.\r\n\r\nCheck out www.GoSol.org/makers to meet me.\r\n\r\nOur press release about the crowdfunding campaign: http://j.mp/1DFuD4t\r\n\r\nLooking forward to hearing from you.\r\n\r\nBest regards,\r\n\r\nLorin Symington", "from_email": "lorin.symington@solarfire.org"}}, {"pk": 127, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Avram Bram-Mostyn", "message": "Good afternoon,\r\n\r\nI visited TX/RX last night and was really excited; it exceeded my expectations and I think it would be a really good fit for me.  I am a physician finishing my residency training in July and I'm interested in medical device inventing and pursuing some hobbies.  I think I can learn a lot and maybe help others with my somewhat unique perspective/training.  I would like to use the lab at least a couple times per week and I think that having a full bay may be a good option.  Do you have a full bay available and if so what are the monthly dues?  I saw the artist area in the back which seemed to have good space which may work well.  Kojo was very helpful by answering many questions and giving a great tour yesterday.  He recommended that I use this format to contact the lab. \r\n\r\nMuch thanks,\r\n\r\nAvram", "from_email": "adventurspirit@gmail.com"}}, {"pk": 128, "model": "contact.message", "fields": {"user": 2984, "subject": 4, "from_name": "Sarah Kelly", "message": "Hello! I just saw that you have a student discount for Hacker level memberships and I think that's AWESOME. However, I work full time and go to school at night from 6-9 Mon-Thurs, so I really don't have a reason to jump to the higher level from Tinkerer unless I could have access from 10pm to 2am or so. Since you guys are RIGHT next to UH, it would be awesome to be able to come by sometimes and stay late to work on whatever project I had at that time. I came by this past Friday for open house, and your FAQs on the wall mentioned possible 24 hour access. I'm guessing this is something you'd be more comfortable offering to veteran members, so I'd just like some information on how to or the requirements needed to gain access after hours.\r\n\r\nThanks!\r\nSarah ", "from_email": "mewpal13@yahoo.com"}}, {"pk": 129, "model": "contact.message", "fields": {"user": 2679, "subject": 4, "from_name": "Kelly W", "message": "I asked Roland about a small cutting project I want to do, and he suggested using the laser cutter.  However, there are no classes currently scheduled on that machine.  Can I please get some training on it in the near future?  Thanks.", "from_email": "kwhitsett@yahoo.com"}}, {"pk": 130, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Aidan Bynum", "message": "HI, D you have any \"Table Hacker\" spaces open? Im looking to start a small business making cubesat and small robotics kits. Would i be able to use your shop for that?\r\n\r\nThank you", "from_email": "albynum@uh.edu"}}, {"pk": 131, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "Alex Turner", "message": "I am interested in becoming a member at TX/RX Labs. I intend on attending the friday evening open house, but I was hoping there was somebody that I could talk to about possibly joining sooner, ideally today haha, because there are upcoming classes this week that I am interested in. Please advise.\r\n\r\nThank you,\r\n\r\nAlex Turner", "from_email": "apt.2007@yahoo.com"}}, {"pk": 132, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Cesar Regalado", "message": "Hello TX/RX Labs,\r\n My name is Cesar and I have a few questions for you. I am a 16 year old attending YES Prep Southeast College Prepatory. I am a bit of a programmer and model rocketeer and I am interested in expanding my engineering experience, which is why I am contacting you today. I wanted to ask if the workshops and membership were only restricted to adults, or could a minor partucipate in them too. If I was eligible, then I would love to learn more about TX/RX Labs, and if not then I wouldn't mind waiting a couple of years.\r\n\r\nThank you,\r\nCesar Regalado", "from_email": "cregalado1998@gmail.com"}}, {"pk": 133, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Jaewoo Park", "message": "Hi,\r\nI am under the hacker membership and had a question about using the kiln in the firing / finishing booth.\r\nI wanted to use the kiln or a heat gun to configure memory shape for an alloy metal, and was wondering if there were any classes we need to take to use the tool?\r\nBest,", "from_email": "jaewoopark91@gmail.com"}}, {"pk": 134, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "Sabino", "message": "I just joined and paid this morning, I just wanted to make sure I can get access to the laser cutter hangout today, and I have a few questions about the laser cutter (I was there last Friday as well).\r\n\r\nThanks,\r\nSabino", "from_email": "leone1engineering@gmail.com"}}, {"pk": 135, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "LaFayette Childs, II", "message": "I work at a local architecture firm and I am interested in seeing if we can get a tour organized for some of us from the office to come see the facility and find out more about TX/RX and the classes that are offered. I lot of us love designing, and many of use would like to get into making.\r\n\r\nI look forward to hearing from you.\r\n\r\nThank you,\r\nlafayette_childs@gensler.com\r\n713.356.1483 (office direct)\r\n281.401.9497 (cell)\r\n", "from_email": "lafayette_childs@gensler.com"}}, {"pk": 136, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Luca Cohen", "message": "To whom ever this may concern,\r\n\r\nI am contacting you from St. Catherine's School in Houston. I am doing a research on the technology in Houston and I was wondering if my class (which has 20 people including teachers) could get a tour of the hacker space because I am doing a research on the technology in Houston. If this doesn't work out is there anywhere else that I could have a tour of that you know of or a organization in Houston that is involved in technology?\r\n\r\nThank you,\r\nLuca Cohen", "from_email": "lucacohen14@gmail.com"}}, {"pk": 137, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Michael McCathern", "message": "iam interesting in your basic sewing class, and would like some information on the class\r\nmy address is 10225 bissonnet  apt 1215 , houston texas, 77036", "from_email": "greenghostpurple@yahoo.com"}}, {"pk": 138, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Carter", "message": "I have the welding class today at 6:30 getting there from my house could be difficult.  I need to be on the internet though.  Would I be able to use it if I came there early to wait on the class.  Thanks!", "from_email": "carter.df@gmail.com"}}, {"pk": 139, "model": "contact.message", "fields": {"user": null, "subject": 3, "from_name": "Spencer Carmichael", "message": "I had emailed yall a while back to check if the laser cutter had been repaired yet, but I never received any reply; so, what's the status on the laser cutter? I would just come by and check, but I live all the way out in Spring.", "from_email": "spencer.carmichael@gmail.com"}}, {"pk": 140, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Carla Aldecoa de Martinez", "message": "I have children 18 and under....can they take all these classes or is there an age limit?\r\n", "from_email": "carla0872@hotmail.com"}}, {"pk": 141, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Carla Aldecoa de Martinez", "message": "I have children 18 and under....can they take all these classes or is there an age limit?\r\n", "from_email": "carla0872@hotmail.com"}}, {"pk": 142, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Emmanuel Fiscal", "message": "Hello, I was introduced to TX/RX through Dr. Lina Dib, who was a professor of mine. I'm studying mechanical engineering at Rice University. I would like to know if there are any opportunities to join some of the projects currently in progress or that will likely start soon. I may be staying in Houston for the summer and would like to get more acquainted with TX/RX. \r\nThank You", "from_email": "ef10@rice.edu"}}, {"pk": 143, "model": "contact.message", "fields": {"user": 3190, "subject": 2, "from_name": "M.Cleveland", "message": "I just used PayPal to pay for the Welding I class on 5/10 from 4-7pm.  I don't usually use PayPal and I was expecting some sort of confirmation notice from TX/RX.  Could you please verify that I am enrolled correctly?\r\n-Michael", "from_email": "m999cleveland@gmail.com"}}, {"pk": 144, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Travis Guerra", "message": "Hello! I was wondering about cutting some things on the laser cutter. I am thinking of either HDPE or delrin,  I have heard that these materials are cuttable on a co2 laser but not very nicely.  The material is only 2-3mm thick, I don't know how that affects the cut.  If I can't cut these on the laser cutter then I was thinking of cutting them on one of the CNC routers.  I have never worked with either of these materials before so I don't know how they will react to these cutting methods.  If I could get some feedback on this that would be greatly appreciated! Also I have taken the laser cutting class  but I do not have a membership, can I still use it or do I need the membership to do anything on it.  If someone could email me back with this information, that would be amazing! \r\nThanks -Travis Guerra\r\ntravisrg27@gmail.com", "from_email": "Travisrg27@gmail.com"}}, {"pk": 145, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Nathan Lee", "message": "I was wondering if I could use a joiner and a circular saw. I girlfriend and I want to build a shaker style drop leaf table. I have good tool experience. I have built a very complex chair and ottoman as well as my own bed. I had access to a shop in San Antonio, but here in Houston I don't have the space or the money to afford a joiner and table saw. I am proficient in routers, joiners, planers, table saws, and have also do welding as well. What would it take to let me use a table saw, joiner, and maybe some clamps. I would be making 90 degree square cuts. It would take no longer than maybe 3 hours all together, because I'm more anal than anything :)", "from_email": "nathan.e.lee@live.com"}}, {"pk": 146, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Alex Alvarado", "message": "Hello,\r\n\r\nMy name is Alex Alvarado and I am a undergrad student majoring in mechanical engineering technology here at the University of Houston.  I have a question in regards to your 3D printing classes, specifically who teaches them?  Is there an email or way I can contact them directly?  I would greatly appreciate this and thank your for your time.\r\n\r\n-Alex", "from_email": "alvaradoalex809@gmail.com"}}, {"pk": 147, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Michael Issa", "message": "Hi, we are a group of four undergraduate mechanical engineers who are participating in a nationwide competition with NASA. We have to design, manufacture, and test a rock chipping tool that meets a few specified requirements. We have a preliminary design for our device, but we were wondering if we could come in to TXRX and have someone who is experienced in design and fabrication to be able to help us out and guide us in the right direction.  We also want to ask if we can use the EDM machine to machine our device with the necessary parts/metal. I would appreciate it if someone would help us as soon as possible since our deadline for a prototype is in the last week of May. Thank you.", "from_email": "Michael.f.issa@gmail.com"}}, {"pk": 148, "model": "contact.message", "fields": {"user": 2189, "subject": 5, "from_name": "egrliz", "message": "I can't make the Build Your Own Quadcopter class on May2-3. Please let me know when the refund is applied or if you need anything further.", "from_email": "liz@myhitechweb.com"}}, {"pk": 149, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Rachel Marino", "message": "Hello. \r\nWe wanted to know what the age requirements are for membership. Our 14 year old is very interested in several of your classes. \r\nThank you. \r\nRachel \r\n", "from_email": "Rachel.greg.marino@gmail.com"}}, {"pk": 150, "model": "contact.message", "fields": {"user": 2189, "subject": 5, "from_name": "Liz Lundgren (login name: egrliz)", "message": "I apologize for the duplicate message, but I want to confirm that I will not be able to attend the \"Build your own quadcopter\" class. The class is full now, so removing my enrollment will give someone else an opportunity to take the class. Please let me know if you will be applying the refund to my credit card.\r\n\r\nBest regards,\r\nLiz Lundgren\r\n713-205-7000", "from_email": "liz@myhitechweb.com"}}, {"pk": 151, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Mat Wolff", "message": "Good Morning,\r\n\r\nMy name is Mat Wolff. I am the Associate Director at American Institute of Architects Houston Chapter (AIA Houston) and Architecture Center Houston. I toured your facilities a couple weeks back. AIA Houston's Young Architects Forum is planning to start a local design residency for our members. We are interested in possibly including a membership at TX/RX as part of that residency. We are in the early planning stages, but think the residency would last approximately 6 months. Depending on our funding there could be 1 - 3 residents each year. In addition to paying their membership at TX/RX  we would also provide a other resources that might include paying for classes at TX/RX. Our committee would like the opportunity to meet with a member of your board or other representative to discuss our program and to determine if TX/RX is a good fit and how we can make the most out that partnership. You can reach me at mat@aiahouston.org or 713-520-0155 (office) and 713-261-2175 (cell). I appreciate your time and look forward to discussing further.\r\n\r\nMat Wolff\r\n", "from_email": "mat@aiahouston.org"}}, {"pk": 152, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "Murat Ocalan", "message": "Hi - \r\nI had attended one of your Friday evening tours some time back and interested in working in the machine shop for some light work. I need to get a drill press job done in short order. How soon can I get going once I become a member?\r\n\r\nThank you,\r\nMurat\r\n", "from_email": "mocalan@alum.mit.edu"}}, {"pk": 153, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Greg Kuiper", "message": "Greetings!\r\n\r\nI have a bunch of 1U and 2U rackmount servers that are in good working condition, but we can't use them as we're switching over to Dell.  Would we be able to work out a trade - servers for membership/classes, perhaps?  Let me know.  Thanks!\r\n\r\nGreg Kuiper\r\ncPanel Inc.\r\n832-744-8695", "from_email": "greg@cpanel.net"}}, {"pk": 154, "model": "contact.message", "fields": {"user": null, "subject": 5, "from_name": "Amanda ", "message": "I have paid and signed up and paid for 3 classes that i won't be able to make. I need to cancel", "from_email": "xpandax136@gmail.com"}}, {"pk": 155, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "STEVE", "message": "   WHAT IS YOUR PHONE #   ? \r\n\r\nPLEASE CALL ME AT   504  233   8913  \r\n  \r\n     \r\n", "from_email": "MANDEVILLE752@GMAIL.COM"}}, {"pk": 156, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Nicole Barton", "message": "This may sound a little unusual, but I am hoping you might be able to help me! I would like to speak with you about a French robotics enthusiast who will be visiting Houston for a few weeks this summer. I am a coordinator for a summer exchange program, matching international teens with local host families to learn about American culture and practice their English skills. I have a particular young man who has requested to come to Houston this year, and he is a self-described \"science freak\" with a passion for robotics and all things science! Rather than place him with just any family, I thought he might have an amazing experience if placed with a family that has a child with similar interests. I was wondering if you might happen to know of any families who might have be interested in learning more about hosting, or if you would be willing to share the information with the members of your group? \r\n\r\nThis student's name is Robin, he is 15 years old and from France. He needs a host family from June 17 - July 22. This is a short-term commitment, but an amazing cultural experience! Our students speak English, and bring their own spending money and health insurance. Families are asked to provide a bed, meals, and their warm hospitality! Families also are provided with a small weekly stipend to help with costs. \r\n\r\nI would welcome the opportunity to speak with you in greater detail about the program offered by Compass USA. I have coordinated this program for the past 5 years, and I am so excited to meet the new crop of teens each summer! \r\n\r\nAttached is a link to an online flyer with more information about the program, and short summaries of the students. If you could reply with an email address, I can forward Robin's letter he wrote to his prospective host family. He seems like a really great kid, and I am excited to find the perfect family for him! Thank you in advance for any help you can give.\r\n\r\nWarm regards,\r\nNicole Barton \r\nRegional Supervisor\r\nCompass USA\r\n832-922-3672\r\n\r\nhttps://www.smore.com/jr0ur-interested-in-hosting-a-student\r\n\r\n", "from_email": "nbarton31@yahoo.com"}}, {"pk": 157, "model": "contact.message", "fields": {"user": null, "subject": 1, "from_name": "Kelli Grand", "message": "I registered with kelli.grand@gmail.com - but apparently i didn't complete the registration within 7 days. Now I can't reset the password because the account 'doesn't exist'. I can't register a new account because the email is used. Can you please fix?", "from_email": "kelli.grand@gmail.com"}}, {"pk": 158, "model": "contact.message", "fields": {"user": null, "subject": 3, "from_name": "Jordan Snyder", "message": "We have a taz 4 printer and we received a taz 5 printer head replacment part. We are now having troubles with printing. Is this something you would be able to help us with if we bring it in? Any info would be helpful. Thank you", "from_email": "jjsnyder790@gmail.com"}}, {"pk": 159, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Michael Issa", "message": "Hello Roland, Michael here, we spoke recently about the design challenges. Here are the requirements. Feel free to contact me by cell or email once you spread the word. \r\n\r\n8324664225\r\nMichael.f.issa@gmail.com\r\n\r\nAlso, please let me know what days are OK for us to stop by. The prototype is due for testing by the first week of June.\r\n\r\nThanks for the help, we don't really know who else to turn to.\r\n\r\n\r\nCHALLENGE: ROCK CHIP SAMPLING DEVICE FOR MICROGRAVITY BODIES\r\nNASA Mission Connection \r\nNASA is currently working on systems to take humans beyond Low Earth Orbit to explore the solar \r\nsystem. One of the destinations of interest is an asteroid. \r\nAsteroids are among the solar system’s most primitive bodies and are interesting to scientists. A specific \r\nsample of interest for collection is a ‘chip’ sample and is defined as a sample which is forcibly removed or \r\nbroken off from a larger piece of the parent body. \r\nDeveloping a functional prototype tool to break these samples from the asteroid safely while capturing \r\nand containing them for return to Earth is the purpose of this challenge.\r\nObjective \r\nDesign and manufacture a method for an astronaut to break off and contain ‘chip’ style samples from an \r\nasteroid in microgravity.\r\nRequirements \r\n1. The system shall be capable of containing chips up to approx. 1”x1”x1”\r\n2. The system shall be capable of creating chips less than approx. 1”x1”x1”\r\n3. The system shall capture and retain at least one chip per sample site\r\n4. The system shall provide for collection of samples from 3 separate sites without cross \r\ncontamination between sites\r\n5. The system shall provide for storage of samples independent of one another\r\n6. The system shall prevent chipping debris from impacting the crew member\r\n7. The system shall weigh less than 15 lbs, the lighter the better\r\n8. Powered operations shall be driven manually, pneumatically, and/or hydraulically (with peanut \r\noil)\r\n9. The system shall be ambidextrous\r\n10. The system shall work on rough surfaces that are either; concave, flat, or convex\r\n11. The system shall be compatible with a chlorine water environment\r\n12. The chipping task shall be capable of one-handed operation\r\n13. The system shall function after a 3 foot drop test onto concrete\r\n14. The system shall have a tether attachment point", "from_email": "mike.leb140@gmail.com"}}, {"pk": 160, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Julie Palke", "message": "Hi Roland,\r\n\r\nI'm the redhead with tons of questions from tonight's first tour.  Thank you very much for your patience.  Not surprisingly, I have more questions.  \r\n\r\nI would very much like to take the May 15th and 17th Woodworking Tools I class.  I have 4 projects that are currently ready to start except for acquisition of the materials.  I would like to point out that I have taken a similar class at A&M's workshop and was granted lifetime access to their shop.  Alas, that was 20 years ago, so I definitely need a refresher on big shop tools and want safety training specific to your equipment.  I understand if it is not possible to add me to the class, but appreciate your willingness to see if the class might have room for me.  \r\n\r\nI would also like to talk to you about donations of materials and equipment.  This is not a bribe!  I have somethings that I could lend to the lab, if there are people who would use them.  Much of it is sewing equipment, but we also have my father in law's workshop, and he was fond of purchasing in duplicate, and keeping things in their packages.  I'm not sure exactly what woodworking tools and supplies I have extras of, but I can take a look sometime soon.  Example sewing items: half legged size 8 dress form with custom sizing pad kit and cover, Bernina 1000 sewing machine, various dressmaker and quilter rulers, tools, and fabrics.  I also have nearly all of the issues of Threads magazine from the 20's to the 130's, and it is a wonderful educational resource for sewing.  \r\n\r\nI am also interested in learning about the available bays and 1/4 bays, as well as any policies regarding children.  My twelve year old son is currently in a robotics class at school and I was hoping that the lab might be a good place for him to work on that and perhaps learn from others since I know next to nothing about robots.  My other son is very creative and interested in computers and I think that exploring electronics or CAD will lead to many interesting creations.  We are all hoping to research and experiment with both solar and wind power generation and storage so we can create our own working renewable energy system. \r\n\r\nThank you for your time, and I look forward to spending a great deal of productive time at TX/RX Labs.\r\nJulie Palke\r\n281-660-4377\r\n\r\n", "from_email": "jpalke@gmail.com"}}, {"pk": 161, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Bill Kinslow", "message": "Hi,\r\n\r\nI can not get the registration process working. After registering, it will not let me log on. It also will not let me reset my password. Please advise.\r\n\r\nThanks\r\nBill", "from_email": "billkinslow@gmail.com"}}, {"pk": 162, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Wendy", "message": "Hello,\r\n\r\nI have a suggestion for a class in basic mechanics. It's geared toward single women in Houston that feel like they are being taken advantage of by their mechanic or feel lost when talking about their car.  I'm not sure what the requirements are to start a class from scratch but I think you would get a lot of women to sign up. \r\n\r\nI hope this helps!\r\n\r\nBest,\r\nWendy", "from_email": "moralewend@gmail.com"}}, {"pk": 163, "model": "contact.message", "fields": {"user": null, "subject": 5, "from_name": "Jim tai", "message": "Hello! \r\nI signed up for today's 3d-printing class at 3pm today 4/26/15. However due to personal reasons, I am unable to attend (along with lack of transportation). I apologize for this inconvenience. Could the amount be refunded to me? Or applied for a future class?\r\nThank you!\r\n\r\nJim Tai", "from_email": "Jimtai590@gmail.com"}}, {"pk": 164, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Wolter ", "message": "Hi there,\r\n\r\nI was wondering if you could tell me when the CNC plasma table will be operational. I came by this past Saturday and the guy I talked to said it's not ready yet.\r\nI'll become a member soon.\r\nRegards,\r\nWolter van der wier", "from_email": "wikisi9@gmail.com"}}, {"pk": 165, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "CCD: colony collapse disorganization/distro/mobile infoshop/crowdsourced e-zine/disaster waiting to happen", "message": "hi, \r\n\r\nwe are hoping to host a https://www.cryptoparty.in/index in houston and are looking for a suitable space. would TXRX allow such a thing? any ideas for other spaces with sufficient square footage/bandwidth?\r\n\r\nthanks,\r\ncolony collapse collective", "from_email": "ccd2k15@riseup.net"}}, {"pk": 166, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Alfred Chioiu", "message": "Hello,\r\n\r\nI am trying to reach your members by email. If you consider this spam, please accept my apologies and please ignore the message. If this is something that your members might be interested in, I would appreciate if you could forward this email to them.\r\n\r\nThank you,\r\n\r\n-Alfred Chioiu\r\n \r\n\r\nHello,\r\n\r\nMy name is Alfred Chioiu. I am a member of Dim Sum Labs http://www.dimsumlabs.com/about-us/, a hacker space in Hong Kong.\r\n\r\nI am working on an open source hardware project called LiV. LiV is a sensor expansion board that turns a Raspberry Pi into an Internet-connected indoor air quality monitoring device. LiV measures temperature, humidity, air pressure and CO2 levels.\r\n\r\nAll LiV hardware schematics, PCB, Bill Of Materials and software files are available in this github repository: https://github.com/FirstCypress/LiV. There are also STL files for a 3D printed case. Anyone interested in building LiV can download the files and follow the instructions to build their LiV device: http://www.firstcypress.com/liv-assembly-instructions.html\r\n\r\nFor those with no interest to fabricate their own PCBs and outsource electronics, I am selling LiV kits and fully assembled units on my company website.\r\n\r\nI am currently offering free shipping worldwide (valued at USD 20) and an additional discount of USD 10 to registered members of hacker/maker spaces and contributors to open-source projects. \r\n\r\nHere is a link to the LiV store http://www.firstcypress.com/store/c1/Featured_Products.html.\r\n\r\nI am also offering additional significant discounts to hacker/maker spaces that would be interested to use LiV for hackathons or workshops teaching soldering, Python programming, Linux on Raspberry Pi, etc… \r\n\r\nI would appreciate if you could forward my email to your members or anyone who might be interested in building LiV. Please feel free to get in touch with me in order to get a discount code before ordering LiV.\r\n\r\nHere is LiV on hackaday https://hackaday.io/project/2636-liv\r\n\r\nIn case you are visiting Hong Kong, I would like to invite you to Dim Sum Labs. Please send me an email or contact us at the email address listed on our Dim Sum Labs webpage a few days before your visit. We are always happy to meet like-minded people. \r\n\r\nThank You,\r\n\r\nAlfred \r\n\r\n-- \r\nAlfred Chioiu\r\nFounder and CEO\r\nFirst Cypress \r\nalfred.chioiu@firstcypress.com", "from_email": "alfred.chioiu@firstcypress.com"}}, {"pk": 167, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Darryl Fett", "message": "hi - I was scheduled for welding II  this past Saturday but it was cancelled due to Roland's unfortunate incident with his car.  I had originally told him I'd make it up on May 9th, as I'm there for 3D printing that afternoon anyway. \r\n\r\nBut I've had something come up that morning so would like to take the makeup class on July 11th instead.  \r\n\r\ncan you please confirm me for that class?  I'll send Roland a mail too\r\n\r\nthanks \r\n\r\nDarryl Fett", "from_email": "dfett2003@hotmail.com"}}, {"pk": 168, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "Buffy Song", "message": "Hello,\r\n\r\nCan I attend a class without a membership? Do I need to be a registered user to be able to add and pay for a class? \r\nI am interesting in the leather classes because I want to make a wallet. Will I have the option to make a wallet of my preferred style, such as a billfold with a coin pocket. Do you have different color/finishing leather? Can I get a refund after coming to the class to realize that I do not like the materials provided, without attending the class.\r\n\r\nThank you!\r\nBuffy", "from_email": "Reachbuffy@hotmail.com"}}, {"pk": 169, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Rod Stewart", "message": "Hi all, I had my membership setup as recurring through PayPal but the card I was using was closed due to a security breach. The recurring PayPal setup was cancelled, what do I need to do to get it reinstated?\r\n\r\nThanks, \r\nRod\r\n\r\nIf it helps: \r\n\r\nHello Rodney Stewart,\r\n\r\nTx/Rx Labs has suspended your automatic payments. Contact Tx/Rx Labs for more details or to reactivate your payments.\r\n\r\nHere are the details:\r\nTo:\tTx/Rx Labs\r\nFor:\tAutomatic payment ID:\tI-RD0FVASNMCTL", "from_email": "rodstewart@gmail.com"}}, {"pk": 170, "model": "contact.message", "fields": {"user": null, "subject": 2, "from_name": "James Morrison", "message": "What would be the best class to learn how to make molds for props and things of that nature? ", "from_email": "Jim.morrison1201@gmail.com"}}, {"pk": 171, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Ashana Patel", "message": "Good morning!  I am an architecture student interested in using a few tools (mainly the laser cutter and a saw to cut material)  at your facility.  I wanted to know if I were to purchase a tinkerer membership today would I be able to come in tomorrow during tinker time to laser cut?  I am cutting it really close to a deadline and being able to use these tools on a Sunday would be greatly appreciated!  Please let me know if this is possible.  Thank you so much.\r\n\r\nAshana   ", "from_email": "ashana.patel@gmail.com"}}, {"pk": 172, "model": "contact.message", "fields": {"user": 3288, "subject": 4, "from_name": "Wolter ", "message": "Hi there,\r\n\r\nI'd like to sign up but I can't use PayPal. Is there another way to pay the monthly fee?", "from_email": "wikisi9@gmail.com"}}, {"pk": 173, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "John", "message": "I am rebuilding a classic motorcycle and would like to make the leather seat covering.  I am looking for a sewing machine (>1 hp)  that I could use to sew 4-5oz leather.  Do you have a machine like this?\r\n\r\nThanks,\r\nJohn", "from_email": "Wheatjohns@gmail.com"}}, {"pk": 174, "model": "contact.message", "fields": {"user": 3242, "subject": 2, "from_name": "Sam C", "message": "I am scheduled for Welding I on May 10 and would like to reschedule to a different date if possible.", "from_email": "samjcarroll@gmail.com"}}, {"pk": 175, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Michael Issa", "message": "Hi Roland, just wondering if there were any updates regarding the project for NASA.\r\nCould you please reply to me and let me know what to do or what to expect. \r\nThanks", "from_email": "mike.leb140@gmail.com"}}, {"pk": 176, "model": "contact.message", "fields": {"user": null, "subject": 4, "from_name": "Humberto Hernandez", "message": "Would you guys rent out the computer room once a week around 6:30-10pm?", "from_email": "hhernandez15@miners.utep.edu"}}]
