[{"pk": 1, "model": "content.page", "fields": {"name": "about"}}, {"pk": 2, "model": "content.page", "fields": {"name": "joinus"}}, {"pk": 3, "model": "content.page", "fields": {"name": "join"}}, {"pk": 4, "model": "content.page", "fields": {"name": "join_us"}}, {"pk": 2, "model": "content.copy", "fields": {"body": "<p>\r\n\tLocated at 2010 Commerce St. Houston, Tx 77002</p>\r\n<p>\r\n\tTx/Rx Labs is Houston&rsquo;s Hackerspace. We are a project-based team of makers with backgrounds in the creative arts: electronic circuitry, music composition, 3D printing, computer science and security, screenprinting, fashion design, and even haute cuisine.</p>\r\n<p>\r\n\tVisit us on Open House Fridays at 8pm to:</p>\r\n<ul>\r\n\t<li>\r\n\t\tVisit with our members.</li>\r\n\t<li>\r\n\t\tLearn about our upcoming classes and workshops.</li>\r\n\t<li>\r\n\t\tSee exciting technical demonstrations.</li>\r\n\t<li>\r\n\t\tShare your own projects.</li>\r\n\t<li>\r\n\t\tEnjoy some home cooking.</li>\r\n\t<li>\r\n\t\tDiscuss the latest developments in science and technology.</li>\r\n\t<li>\r\n\t\tHang out with a friendly crowd of technology and craft enthusiasts.</li>\r\n</ul>\r\n<h2>\r\n\tOur Goals</h2>\r\n<p>\r\n\tOur goals are to bring creative people together, to serve as an incubator for imaginative solutions for everyday problems, to make opaque scientific and technical concepts accessible to everyone through education, and to provide much-needed services to our community, made possible by the skills and passion of our membership.</p>\r\n<h2>\r\n\tHow to Participate</h2>\r\n<p>\r\n\tMost of our events are open and available to the general public. Access to some of our lab space and tools is limited to our members who have undergone training in the safe use of our lab tools and safety equipment. Information on our upcoming events is available on our calendar.</p>\r\n<p>\r\n\tYou can become a member by coming to one of our Open House Fridays and telling one of our officers or directors that you want to be a member.&nbsp; The membership fee gets you access to tools, collective wisdom, and a racous list-serve!&nbsp; We have been known to stay late and turn the volume to eleven.&nbsp; We look forward to welcoming you to Tx/Rx Labs.</p>\r\n<h2>\r\n\tWhy TX/RX Labs?</h2>\r\n<p>\r\n\tImagine how much innovation could occur if the creative community in Houston had access to the tools and knowledge needed to bring its ideas to fruition.&nbsp; We believe that we must revive the tradition of design and manufacturing in America after decades of neglect and decline.&nbsp; Many of America&rsquo;s greatest industries began in inspired moments in garage workshops.&nbsp; We hope to provide you with that workshop through our classes and other educational programs, collective wisdom, and lab space.</p>\r\n<h2>\r\n\tHow to Help</h2>\r\n<p>\r\n\tBecome a member.&nbsp; Our greatest resource is the diversity and creativity of our members, and we are always open to new perspectives and disciplines.<br />\r\n\tVolunteer!&nbsp; We need people to help spread the word about what we are trying to do.&nbsp; Email us at <a href=\"mailto:txrxlabs@googlegroups.com\">txrxlabs@googlegroups.com</a> or visit us on Open House Fridays and we will find a way for you to help.</p>\r\n<ul>\r\n\t<li>\r\n\t\t<a href=\"/donate\">Make a cash donation</a>.</li>\r\n\t<li>\r\n\t\tDonate tools, computers, electronics.&nbsp; Have a tool you don&rsquo;t use that often?&nbsp; We can use it!</li>\r\n</ul>\r\n<h2>\r\n\tMore Information</h2>\r\n<ul>\r\n\t<li>\r\n\t\tTx/Rx Labs :&nbsp; <a href=\"http://www.txrxlabs.info\">www.txrxlabs.info</a> , <a href=\"http://www.meetup.com/TXRXLabs/\">http://www.meetup.com/TXRXLabs/</a></li>\r\n\t<li>\r\n\t\tWeekly photos can be found at <a href=\"http://www.meetup.com/TXRXLabs/photos/\">http://www.meetup.com/TXRXLabs/photos/</a></li>\r\n\t<li>\r\n\t\tTx/Rx Labs Google Group: <a href=\"http://groups.google.com/group/txrxlabs\">http://groups.google.com/group/txrxlabs</a></li>\r\n\t<li>\r\n\t\tMailing List:&nbsp; <a href=\"mailto:txrxlabs@googlegroups.com\">txrxlabs@googlegroups.com</a></li>\r\n\t<li>\r\n\t\t<a href=\"http://Location 2010 Commerce St. Houston, Tx 77002  Tx/Rx Labs is Houston’s Hackerspace. We are a project-based team of makers with backgrounds in the creative arts: electronic circuitry, music composition, 3D printing, computer science and security, screenprinting, fashion design, and even haute cuisine.  Visit us on Open House Fridays at 8pm to:  Visit with our members. Learn about our upcoming classes and workshops. See exciting technical demonstrations. Share your own projects. Enjoy some home cooking. Discuss the latest developments in science and technology. Hang out with a friendly crowd of technology and craft enthusiasts. Our Goals  Our goals are to bring creative people together, to serve as an incubator for imaginative solutions for everyday problems, to make opaque scientific and technical concepts accessible to everyone through education, and to provide much-needed services to our community, made possible by the skills and passion of our membership.  How to Participate  Most of our events are open and available to the general public. Access to some of our lab space and tools is limited to our members who have undergone training in the safe use of our lab tools and safety equipment. Information on our upcoming events is available on our calendar.  You can become a member by coming to one of our Open House Fridays and telling one of our officers or directors that you want to be a member.  The membership fee gets you access to tools, collective wisdom, and a racous list-serve!  We have been known to stay late and turn the volume to eleven.  We look forward to welcoming you to Tx/Rx Labs.  Why TX/RX Labs?  Imagine how much innovation could occur if the creative community in Houston had access to the tools and knowledge needed to bring its ideas to fruition.  We believe that we must revive the tradition of design and manufacturing in America after decades of neglect and decline.  Many of America’s greatest industries began in inspired moments in garage workshops.  We hope to provide you with that workshop through our classes and other educational programs, collective wisdom, and lab space.  How to Help  Become a member.  Our greatest resource is the diversity and creativity of our members, and we are always open to new perspectives and disciplines. Volunteer!  We need people to help spread the word about what we are trying to do.  Email us at txrxlabs@googlegroups.com or visit us on Open House Fridays and we will find a way for you to help. Make a cash donation. Donate tools, computers, electronics.  Have a tool you don’t use that often?  We can use it! More Information  Tx/Rx Labs :  www.txrxlabs.info , http://www.meetup.com/TXRXLabs/ Weekly photos can be found at http://www.meetup.com/TXRXLabs/photos/ Tx/Rx Labs Google Group: http://groups.google.com/group/txrxlabs Mailing List:  txrxlabs@googlegroups.com Flickr Photostream Tx/Rx Flickr Group Hackerspaces :  www.hackerspaces.org\">Flickr Photostream</a></li>\r\n\t<li>\r\n\t\t<a href=\"http://www.flickr.com/groups/technologycollective/\">Tx/Rx Flickr Group</a></li>\r\n\t<li>\r\n\t\tHackerspaces :&nbsp; <a href=\"http://www.hackerspaces.org\">www.hackerspaces.org</a></li>\r\n</ul>\r\n", "page": 1, "context": "about-body", "name": "body"}}, {"pk": 7, "model": "content.copy", "fields": {"body": "<p>\r\n\tIf you&rsquo;d like to become a member, please visit with one of us at our weekly Open House held each Friday at 2010 Commerce Street, Houston, Texas 77002. Members of TX/RX Labs enjoy varying access to the Lab depending on their membership level. All members must sign a liability waiver and agree to abide by all Lab policies.</p>\r\n<p>\r\n\tWe welcome all interested individuals to membership in TX/RX Labs. If you are interested in joining the Lab, but cannot afford the membership fee, come talk to an officer or director at one of our Open Houses. Financial situation should not hold back any enthusiast from joining the Lab.</p>\r\n", "page": 4, "context": "join_us-top", "name": "top"}}]